import React from 'react'
import style from "./Info.module.css"
import backG from "../../assets/birsa-removebg-preview.png"

const Info = () => {
  return (
    <div className={style.infopage}>
      <div className={style.starting_info}>
        <p>             जनजाती कल्याण आश्रम हजारो वर्षांपूर्वी आपल्या संस्कृतीचा उदय झाला वनांमधून. या संस्कृतीची जोपासना केली. तेथील रहिवाश्यांनी म्हणजे जनजाती बांधवांनी. त्यांनाच आदिवासी, जनजाती असंही संबोधलं जातं, खरं तर या जनजातींशी आपलं रक्ताचं नातं आहे, पण स्वातंत्र्यानंतरही त्यांच्या वाट्याला उपेक्षाच आली, ही परिस्थिती बदलली पाहिजे असं तीव्रतेनं वाटल्यानं महात्मा गांधीचे शिष्य पू. ठक्करबाप्पा यांनी जनजाती क्षेत्रात अनेक सेवाकार्ये सुरू केली. या सेवाकार्यापासून प्रेरणा घेऊन रमाकांत केशव ऊर्फ बाळासाहेब देशपांडे यांनी २६ डिसेंबर १९५२ या दिवशी वनवासी कल्याण आश्रम या सामाजिक संस्थेची स्थापना केली. ही स्थापना झाली (तेव्हाच्या) मध्यप्रदेशमध्ये असलेल्या जशपूर गावात. बाळासाहेब देशपांडे यांना या कार्यासाठी (तेव्हाचे) सरसंघचालक प.पू. गोळवलकर गुरुजी यांचे आशीर्वाद लाभले होते.</p>
        <p>             कल्याण आश्रमाच्या माध्यमातुन जनजाती बांधवांना स्वावलंबी, स्वाभिमानी आणि संघटित करण्याचे कार्य आता संपूर्ण देशात विस्तारले आहे. हजारो समर्पित कार्यकर्त्यांच्या बळावर जनजाती क्षेत्राच्या प्रत्येक कोपऱ्यात हे कार्य पोहोचू शकेल, प्रत्येक समस्येला तोंड देऊ शकेल असे एक देशव्यापी संघटन उभारण्यात कल्याण आश्रम यशस्वी ठरला आहे. या कार्याचा परिणाम म्हणून जनजाती समाजातले हजारो कार्यकर्ते आपापल्या क्षेत्रात पाय रोवून उभे राहिले आहेत. कल्याण आश्रमातर्फे जनजाती क्षेत्रात हजारो सेवाप्रकल्प उभे करण्यात आले आहेत. या प्रकल्पांच्या द्वारे जनजाती समाजाची सेवा तर केली जात आहेच पण त्यांच्यात राष्ट्रीय भावनेचं जागरणही मोठ्या प्रमाणावर केलं जात आहे.</p>
        <p>             वनवासी कल्याण आश्रमाची विभागणी देशपातळीवर ४० प्रांतांमध्ये करण्यात आली असून, महाराष्ट्रात ४ प्रांत आहेत. या प्रांतांपैकी पश्चिम महाराष्ट्र प्रांतामध्ये जनजाती कल्याण आश्रम, या नावाने संघटनेने व्यापक सेवाकार्य उभे केलेले आहे. शिक्षण, आरोग्य, आर्थिक विकास, बचत गट, श्रध्दा जागरण, पर्यावरण संरक्षण व संस्कार इ. विषय घेऊन हजारो सेवा प्रकल्प उभे राहिले. या साऱ्या प्रकल्पांच्या माध्यमातुन देशभरातील जनजाती क्षेत्रात जनजागृती होऊन प्रचंड शक्ती निर्माण होत आहे.</p>
        <p>             जनजाती बांधवांसाठी जनजाती कल्याण आश्रम महाराष्ट्रातही अनेक वर्षे कार्य करीत आहे. जनजाती मुलामुलींसाठी वसतीगृहे, शाळा चालविली जात आहेत. अशा विद्यार्थ्यांच्या सर्वांगीण विकासासाठी समाजाकडुन सक्रीय सहकार्याची अपेक्षा आहे. वैज्ञानिक युगात नव्या तंत्रज्ञानाचा अभ्यासक्रम शिकवायचा आहे. सर्व समाजाच्या पाठबळावरच गुही सारखे भव्य शिक्षण प्रकल्प, शाळा, प्रशिक्षण केंद्र इ. अनेक उपक्रम सुरु आहेत. सहयोग राशी घेऊन निधीसंकलनाचे व माणसे जोडण्याचे दुहेरी कार्य सातत्याने सुरु आहे. केवळ आर्थिकच नव्हे तर आपल्याकडे असलेले कौशल्य, वेळ देऊनही आपण या कार्यात सहभागी व्हावे, हि विनंती. </p>
        <p>             नाशिक, पुणे, कोल्हापूर, सांगली, सातारा, नगर, सोलापूर या जिल्ह्यांचा समावेश पश्चिम महाराष्ट्र प्रांतात होतो. या प्रांताचे मुख्य कार्यालय नाशिक येथे आहे. </p>
      </div>
      <div className={style.fullcircle}>
        <div className={style.circles}><p>आरोग्य</p></div>
        <div className={style.circles}><p>हित रक्षा</p></div>
        <div className={style.circles}><p>ग्रामविकास</p></div>
        <div className={style.circles}><p>खेळ कुद</p></div>
        <div className={style.circles}><p>लोक कला</p></div>
        <div className={style.circles}><p>प्रचार प्रसार</p></div>
        <div className={style.circles}><p>छात्रा वास</p></div>
        <div className={style.circles}><p>शिक्षण</p></div>
        <img src={backG} alt="" />
      </div>
    </div>
  )
}

export default Info