import { addDoc, collection } from "firebase/firestore";
import { db } from "./firebase.config.js";

const data = [
    "अभोणा", "अंबापूर", "अंबिका ओझर (न.व.)", "अंबुर्डी ब.क.", "अंबुर्डी ख.",
    "आमदार", "आसोली", "आठंबे", "बाबखेडा", "बागडू", "बालापूर", "बारडे", "बेळबारे",
    "बेंडपाडा (न.व.)", "भदवण", "भगुर्दी", "भाकुर्डे", "भंडाणे (हटगड)", "भंडाणे {पिंपळे}",
    "भेंडी", "भुसणी", "भुताणे", "बिजोरे", "बिलवाडी", "बोरडायवट", "चाचेर", "चांदवड",
    "चाफापाडा", "चिंचोरे", "दाह्याणे डिगर", "दाह्याणे (ओटूर)", "दाह्याणेपाले", "दळवट",
    "दरे भाणगी", "दरेगाव हटगड", "दरेगाववाणी", "दत्तानगर", "देशगाव", "देशराणे", "देवली कराड",
    "देवलीवाणी", "धनर डिगर", "धनोली", "धर्डे डिगर", "धेकळे", "एकलाहरे", "गंगापूर", "गंगावण",
    "गणोरे", "गोबापूर", "गोलखाल", "गोपालखडी", "गोसरणे", "हिंगवे", "हुंड्यामोक", "इंशी",
    "जयादर", "जयपूर", "जामलेवाणी", "जामले (हटगड)", "जामलेपाले", "जामशेत", "जिरवडे (हटगड)",
    "जिरवडे ओटूर", "काकणे", "काळमठे", "कळवण ब.क.", "कळवण ख.", "कणाशी", "कण्हेरवाडी",
    "करांबेल हटगड", "करांबेल कणाशी", "कर्माळे", "कातलगाव", "कठारे डिगर", "खडक", "खडकवण",
    "खर्डे डिगर", "खेडगाव", "खिराड", "कोसुरडे", "कोस्वान", "कुंमसडी", "कुंडाणे {कणाशी}",
    "कुर्दाणे (ओटूर)", "लाखणी", "लिंगमे", "माचिधोडाप", "मालगाव ब.क.", "मालगाव ख.",
    "मांगलिदार", "मनूर", "मारकड पिंप्री", "मेहडर", "मोहमुख", "मोहनदरी", "मोहोबरी",
    "मोहपाडा (न.व.)", "मोकभाणगी", "मुलानेवाणी", "नकोडे", "नलिद", "नंदुरी", "नारुळ", "नवी बेज"
];

const looper = () => {
    data.map(async (e) => {
        // if (window.confirm("Are You Sure To add " + e.name)) {
        const docRef = await addDoc(collection(db, "vilages"), {
            name: e,
            division_id: "WAvqfe7JxOXWuvOvSWX6"
        });
        console.log(e + " added");
        // } else {
        // alert(e.name + " Discarded");
        // }
    })
}

looper();