import { addDoc, collection } from "firebase/firestore";
import { db } from "./firebase.config.js";

const data = [
    {
        "पद": "अध्यक्ष",
        "नाव": "श्री दत्ता भिकाजी नाईक",
        "पत्ता": "आलम, परवरी पुलिस स्टेशन के पिछे, \nपुंडलिक नगर, गिरीजा, पणजी, \nगोवा-403521 ",
        "मो": "मो.: 09422437281",
        "Email": ""
    },
    {
        "पद": "उपाध्यक्ष",
        "नाव": "श्री डॉ. दिलीप केरकर",
        "पत्ता": "फार्मागुडी हाउसिंग सो. फार्मागुडी गोवा \nइंजिनीअरिंग कॉलेज रोड, फार्मागुडी, \nफोंडा, गोवा -403 401 ",
        "मो": "मो.: 09823447092",
        "Email": ""
    },
    {
        "पद": "सचिव",
        "नाव": "श्री अंकुश गावकर ",
        "पत्ता": "संजिवनी कालमामोल टॉपकोला, \nबोरी-फोंडा, गोवा-403 401 ",
        "मो": "मो.: 09422434173",
        "Email": ""
    },
    {
        "पद": "सहसचिव",
        "नाव": "श्री आनंद गावकर ",
        "पत्ता": "गोवा हाऊसिंग बोर्ड, गोवा टेक्निकल \nबोर्ड के पास, परवरी 403 521 ",
        "मो": "मो.: 09423810834",
        "Email": ""
    },
    {
        "पद": "कोषप्रमुख",
        "नाव": "श्री रोहिदास जल्मी ",
        "पत्ता": "मु.पो. पिळगाव, ता. डिचोली, \nउत्तर गोवा 403 504 ",
        "मो": "मो.: 09822101211",
        "Email": ""
    },
    {
        "पद": "संघटनमंत्री",
        "नाव": "श्री राजेश शंकरराव पडोळे ",
        "पत्ता": "C/O, दिगंबर बोरकर, दिपा रेसिडेन्सी, \nअडुळशे-बोरी, फोंडा-गोवा 403 401",
        "मो": "मो.: 08483819166/07774847499",
        "Email": "raj.padole@gmail.com"
    }
]

const looper = () => {
    data.map(async (e) => {
        // if (window.confirm("Are You Sure To add " + e.name)) {
        const docRef = await addDoc(collection(db, "employes_prant"), {
            name: e.नाव,
            job: e.पद,
            address: e.पत्ता,
            position: "Prant Work",
            contact_no: e.मो,
            email: e.Email,
            prant_id: "J64V7ZYa07JAZfXYGWH7"
        });
        console.log(e.नाव + " added");
        // } else {
        // alert(e.name + " Discarded");
        // }
    })
}

looper();